Repository: cwagnersc/redhat-ansible
Catalog: Red-Hat Ansible-level2.tmx
Source language: en_us
Languages: pt_br

source: A few items are worth noting at this point:
pt_br: Poucos itens são dignos de nota neste momento:

source: ANSIBLE_CONFIG (environment variable)
pt_br: ANSIBLE_CONFIG (variável de ambiente)

source: Ad-hoc command: a simple one-off task
pt_br: Comando ad-hoc: uma simples tarefa única

source: Additional output from the remaining hosts has been removed for sake of brevity.
pt_br: Saída adicional dos comopadores restantes foi removida para efeito de brevidade.

source: Ansible for Red Hat Enterprise Linux 7 is located in the Extras channel.
pt_br: Ansible para Red Hat Enterprise Linux 7 é encotrado no canal Extras.

source: Are the developers in your organization speaking another language to you with this whole DevOps thing?
pt_br: OS desenvolvedores na sua organização estão falando outra linguagem para você com toda essa coisa de DevOps?

source: Are you a typical system administrator with too much work and not enough time?
pt_br: Você é um administrador de sistemas típico com muito trabalho e sem tempo suficiente?

source: As we have just discovered, the default configuration file is /etc/ansible/ansible.cfg
pt_br: Como já descobrimos, o arquivo padrão de configuração é o /etc/ansible/ansible.cfg

source: Before getting started, we need to define some terminology:
pt_br: Antes de começar, precisamos definir alguma terminologia:

source: Configuration
pt_br: Configuração

source: Configuration file
pt_br: Arquivo de configuração

source: Control node: the host on which you use Ansible to execute tasks on the managed nodes
pt_br: Nó de Congrole: O computador no qual você usa o Ansible para executar tarfas nos nós gerenciados

source: Documentation for each module can be found at http://docs.ansible.com/ansible/latest/modules_by_category.html
pt_br: A documentação para cada módulo pode ser encontrado em http://docs.ansible.com/ansible/latest/modules_by_category.html

source: Does the prospect of making a simple DNS server change or adjusting kernel parameters across your entire server farm make you cringe?
pt_br: A perspectiva de fazer uma simples alteração no servidor de DNS ou ajuste de parâmetros no kernel em todo o parque de servidores fazem você tremer de medo?

source: Dynamic inventories are also possible, but outside the scope of this post.
pt_br: Inventários dinâmicos também são possíveis, mas está fora do escopo desta postagem.

source: Each node reports SUCCESS and "changed" : true meaning the module execution was successful and the file was created/changed.
pt_br: Cada nó que reporta SUCCESS e "changed": true, indicando que a execução do módulo foi bem sucedida e o arquivo foi criado/alterado.

source: Finally, SSH public key authentication has been configured and tested for this user account from the control node to each of the managed nodes.
pt_br: Finalmente, a chave de autenticação pública do SSH foi configurada e testada para esta conta de usuário do nó de controle para cada um dos nós gerenciados.

source: For Extra Packages for Enterprise Linux (EPEL), this solution in the customer portal may also be helpful.
pt_br: PAra Pacotes Extra para o Enterprise Linux (EPEL), esta solução no portal do cliente tamnéb pode ser útil.

source: For ease of use I'm going to give my system user passwordless sudo in this demonstration, your security policy may vary, and Ansible can handle a wide variety of privilege escalation use-cases.
pt_br: Para facilitar o uso, darei ao meu usuário do sistema sudo sem senha nesta demonstração, sua política de segurança pode variar e o Ansible pode lidar com uma ampla variedade de casos de uso de escalação de privilégios.

source: For sake of simplicity, the control node has the following entries in the /etc/hosts file:
pt_br: Por uma questão de simplicidade, o nó de controle possui as seguintes entradas no arquivo /etc /hosts::

source: Host inventory
pt_br: Inventário de computadores

source: Host inventory: a list of managed nodes
pt_br: Inventário de Computador: uma lista de nós gerenciados

source: Idempotency: an operation is idempotent if the result of performing it once is exactly the same as the result of performing it repeatedly without any intervening actions Environment
pt_br: Idempotência: uma operação é idempotente se o resultado de sua execução uma vez é exatamente o mesmo que o resultado de executá-la repedidamente sem ações de intervenção. Ambiente

source: If we run the command again, the output will include "changed" : false meaning the file is already present and configured as required.
pt_br: Se executarmos o comando novamente, a saída incluirá "changed": false, indicando que o arquivo já está presente e configurado como requisitado.

source: If you’re using Red Hat Enterprise Linux 6, enable the EPEL repository.
pt_br: Se você está usando Red Hat Enterprise Linux 6, habilite o repositório EPEL.

source: In this post, I will be using a minimal configuration file in the home directory of the user account added previously:
pt_br: Nesta postagem, usarei um arquivo de configuração mínimo no diretório home da conta do usuário que foi adicionado previamente:

source: Installation
pt_br: Instalação

source: It is based on the open source Ansible technology, which has become one of the world’s most popular open source IT automation technologies.
pt_br: É baseado na tecnologia de código aberto Ansible, que se tornou uma das mais popualres tecnologias de código aberto para automação de TI do mundo.

source: Let’s check the version:
pt_br: Vamos verificar a versão:

source: Let’s confirm that all hosts can be located using this configuration file:
pt_br: Vamos confirmar que todos os computadores podem ser localizados usando este arquivo de configuração:

source: Managed node: a host that is configured by the control node
pt_br: Nó gerenciado: Um computador que é configurado pelo nó de controle

source: Module: code that performs a particular common task such as adding a user, installing a package, etc.
pt_br: Módulo: código que executa uma tarefa comum particular como adicionar um usuário, instalar um pacote, etc.

source: Note the default configuration file, and that python is required and present in our minimal Red Hat Enterprise Linux 7.4 installation.
pt_br: Note o arquivo da configuração default, e que o python é necessário e está presente em nossa instalaçao mínima do Red Hat Enterprise Linux 7.4.

source: Now that we have our environment configured and ready to go, let’s do some real work with Ansible.
pt_br: Agora que temos nosso ambiente configurado e pronto para seguir, vamos fazer algum trabalho sério com Ansible.

source: Now that we have validated our host inventory, let’s do a quick check to make sure all our hosts are up and running.
pt_br: Agora que validamos nosso inventário do computador, vamos fazer uma rápida verificação para ter certeza que todos nossos equipamentos estão ligados e executando.

source: On Fedora systems you will find Ansible in the base repository.
pt_br: Em sistemas Fedora você encontrará o Ansible no repositório base..

source: Once the appropriate repository has been configured, it’s a quick and simple install:
pt_br: Uma vez que repositório apropriado foi configurado, é uuma instalação rápida e simples:

source: Or worse, making changes based on variable system characteristics such as installed memory or release version?
pt_br: Ou pior, fazer alterações baseados em características variáveis de sistemas tais com memória instalada ou versão de lançamento?

source: Our host inventory file is as follows:
pt_br: Nosso arquivo de inventário está como segue:

source: Playbook: a set of repeatable tasks for more complex configurations
pt_br: Playbook: um conjunto de tarefas repetidas por configurações mais complexas

source: Ready, set, Ansible!
pt_br: Preparar, apontar, Ansible!

source: Red Hat Ansible Automation is an agentless human readable automation tool that uses SSH to orchestrate configuration management, application deployment, and provisioning in a flat or multi-tier environment.
pt_br: Red Hat Ansible Automation é uma ferramena de automação sem agente de leitura fácil aos humanos que usa SSH para orquestrar o gerenciamento de configuração, publicação de aplicaçãoes, e provisionamento em um ambiente padronizado ou em configurações múltiplas.

source: Similarly for individual groups, such as the webservers group:
pt_br: Similarmente para grupos individuais, como o grupo webservers:

source: Since the managed nodes will need to have some additional packages installed, our first task is to configure a yum repository on each host using this configuration file:
pt_br: Como os nós gerenciados precisarão ter alguns pacotes adicionais instalados, nossa primemira tarefa é configurar um repositório yum em cada computador usando este arquivo de configuração:

source: Since we have already configured the managed nodes with a user account, privilege escalation, and SSH public key authentication, we will continue by configuring the control node.
pt_br: Como já configuramos os nós gerenciados com uma conta de usuário, escalonamento de privilégios e autenticação de chave pública SSH, continuaremos configurando o nó de controle.

source: The configuration of the control node consists of both an Ansible configuration file and a host inventory file.
pt_br: A configuração do nó de controle consiste do arquivo de configuração do Ansible e do arquivo de invetário de computadores.

source: The default host inventory file is /etc/ansible/hosts but can be changed via the configuration file (as shown above) or by using the -i option on the ansible command.
pt_br: O arquivo de configuração padrão é o /etc/ansible/hosts mas pode ser alterado via arquivo de configuração (como mostrado acima) ou usando a opção -i no comando ansible.

source: The environment in this post consists of one control node (vm1) and four managed nodes (vm2, vm3, vm4, vm5) all running in a virtual environment with a minimal Red Hat Enterprise Linux 7.4 installation.
pt_br: O ambiente nesta postagem consiste de um nó de controle (vm1) e uatro nós gerenciados (vm2, vm3, vm4, vm5) todas rodando em um ambiente virtual com a instalação mínima do Re Hat Enterprise Linux 7.4.

source: The final setup task in our environment is to configure vm1 with Apache and a Red Hat Enterprise Linux 7 yum repository in order for the managed nodes to install additional packages:
pt_br: A tarefa de configuração final em nosso ambiente é para configurar vm1 com Apache e um repositório yum do Red Hat Enterprise Linux 7 para que os nós gerenciados instlem pacotes adicionais:

source: The number of built-in modules continues to grow with each Ansible release:
pt_br: O número de módulo embutidos contua crescendo com cada nova versão do Ansible:

source: The order in which a configuration file is located is as follows:
pt_br: A ordem na qual o arquivo de está localizado é como segue:

source: This blog post will help you understand the basics of Ansible and how it can be used in your role as a system administrator to more efficiently manage your systems.
pt_br: Esta postagem de blog ajudará você a entender o básico de Ansible e como ele pode ser usado em sua função como administrador de sistemas para gerenciar mais eficientemente seus sistemas.

source: This is only an example and you may wish to use your own sudo configuration variant.
pt_br: Este é apeans um exemplo e você pode querer usar sua própria variação de configuração do sudo.

source: This user account has been configured for privilege escalation via the following entry in the /etc/sudoers file:
pt_br: Esta conta de usuário pode ser configurada para escalação de privilégio através da seguinte entrada no arquivo /etc/sudoers:

source: Through this limited­ time engagement, Red Hat Cloud Success can help you effectively plan and deploy cloud solutions and strategically plan for the future.
pt_br: PP.

source: We can copy this file to each of the managed nodes using an ad-hoc command with the copy module using the -m option and specify the required arguments using the -a option as follows:
pt_br: Podemos copiar este arquivo para cada nó gerenciado usando um comando ad-hoc com o módulo copy usando a opção -m e especificar os arqumentos necessários usando a opção -a como segue:

source: We can see from the above output that all systems returned a successful result, nothing changed, and the result of each "ping" was "pong".
pt_br: Podemos ver pela saída acima que todos os sistemas retornaram um resultado bem-sucedido, nada alterado, e o resultado de cada "ping" foi "pong".

source: We have defined four groups: webservers on vm2 and vm3, dbservers on vm4, logservers on vm5 and lamp which consists of the webservers and dbservers groups.
pt_br: Definimos quatro grupos: webservers com v2 e vm3, dbservers com vm4, logservers com vm5 e lamp que consiste dos grupos webservers e dbservrs.

source: We will be using a simple static inventory file.
pt_br: Usaremos um simples arquivo de invetário estático.

source: We will do this using an ad-hoc command that uses the ping module:
pt_br: Vamos fazer isso usando um comando ad-hoc que usa um módulo ping:

source: You can modify this global configuration file or make a copy specific to a particular directory.
pt_br: Você pode modificar este arquivo de configuração global ou fazer uma cópia específica para um diretório diferente.

source: You can obtain a list of available modules using:
pt_br: Você pode obter a list dos módulos disponíveis usando:

source: ansible.cfg (per directory)
pt_br: ansible.cfg (por diretório)

source: redhat.com A system administrator's guide to getting started with Ansible - FAST!
pt_br: redhat.com Um guia para administrador de sistemas iniciarem com Ansible - RÁPIDO!

source: ~/.ansible.cfg (home directory)
pt_br: ~/.ansible.cfg (diretório home)
